Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Whether the engine owns this database
fr: Que le moteur possède cette base de données ou non
ko: 엔진이 이 데이터베이스를 소유하는지 여부
tr: Bu veritabanının motora ait olup olmadığı
vi: Engine có sở hữu cơ sở dữ liệu này hay không
zh_hans: 该数据库是否归引擎所有
zh_hant: 該資料庫是否歸引擎所有

source: Context id
fr: Identifiant de contexte
ko: 컨텍스트 id
tr: Bağlam kimliği
zh_hans: 上下文 id
zh_hant: 情境 id

source: Columns to select. Omit for all.
fr: Colonnes à sélectionner. Omettre pour tous.
ko: 선택할 열입니다. 모두 선택하려면 생략하십시오.
tr: Seçilecek sütunlar. Tümü için boş bırakın.
vi: Các cột cần chọn. Bỏ trống để lấy tất cả.
zh_hans: 要选择的列。省略则表示全部。
zh_hant: 要選取的欄位。省略則表示全部。

source: Authentication failed. Check your API key.
fr: L'authentification a échoué. Vérifiez votre clé API.
ko: 인증에 실패했습니다. API 키를 확인하십시오.
tr: Kimlik doğrulama başarısız. API anahtarınızı kontrol edin.
vi: Xác thực thất bại. Kiểm tra API key của bạn.
zh_hans: 身份验证失败。请检查您的 API key。
zh_hant: 身分驗證失敗。請檢查你的 API key。

source: %1$@: %2$@ had no column of that name on the destination.
fr: %1$@ : %2$@ n'avait pas de colonne de ce nom sur la destination.

source: List Maintenance Operations
fr: Liste des opérations de maintenance
ko: 유지 관리 작업 목록
tr: Bakım İşlemlerini Listele
vi: Liệt kê thao tác bảo trì
zh_hans: 列出维护操作
zh_hant: 列出維護作業

source: New
fr: Nouveau
ko: 새로 만들기
tr: Yeni
vi: Mới
zh_hans: 新建
zh_hant: 新增

# dropping %@ '%@'
source: dropping %1$@ '%2$@'
fr: Déposer %1$@ '%2$@'
ko: %1$@ '%2$@' 삭제
tr: %1$@ '%2$@' silme
vi: xoá %1$@ '%2$@'
zh_hans: 删除 %1$@ '%2$@'
zh_hant: 刪除 %1$@ '%2$@'

source: SSH Host Key Changed
fr: Clé d'hôte SSH modifiée
ko: SSH 호스트 키 변경됨
tr: SSH Sunucu Anahtarı Değişti
vi: Khóa máy chủ SSH đã thay đổi
zh_hans: SSH 主机密钥已更改
zh_hant: SSH 主機金鑰已變更

source: This database has no Create Table form
fr: Cette base de données n'a pas de formulaire de création de table.

source: %lld ^[rows](inflect: true)
fr: %lld ^[rangs](inflect: vrai)
ko: %lld행
tr: %lld satır
vi: %lld dòng
zh_hans: %lld 行
zh_hant: %lld 列

source: List Favorite Tables
fr: Liste des tables préférées
ko: 즐겨찾는 테이블 목록
tr: Sık Kullanılan Tabloları Listele
vi: Liệt kê bảng yêu thích
zh_hans: 列出收藏的表
zh_hant: 列出收藏的資料表

source: Navigate to referenced row
fr: Naviguez vers la ligne référencée
ko: 참조된 행으로 이동
tr: Referans verilen satıra git
vi: Đi đến dòng được tham chiếu
zh_hans: 跳转到引用行
zh_hant: 前往參照的列

source: Set NULL
fr: Définir NULL
ko: NULL로 설정
vi: Đặt NULL
zh_hans: 设为 NULL
zh_hant: 設為 NULL

# Table collation differs: %@ on source, %@ on target.
source: Table collation differs: %1$@ on source, %2$@ on target.
fr: La collation de la table diffère : %1$@ sur la source, %2$@ sur la cible.
ko: 테이블 콜레이션이 다릅니다. 원본은 %@, 대상은 %@입니다.
tr: Tablo karşılaştırması farklı: kaynakta %1$@, hedefte %2$@.
vi: Đối chiếu của bảng khác nhau: %1$@ ở nguồn, %2$@ ở đích.
zh_hans: 表的排序规则不同：来源为 %1$@，目标为 %2$@。
zh_hant: 資料表的定序不同：來源為 %1$@，目標為 %2$@。

source: Every connection using this profile asks for the password once each time TablePro runs.
fr: Chaque connexion utilisant ce profil demande le mot de passe une fois chaque fois que TablePro est exécuté.

source: List the tables the user opened most recently on a connection, newest first.
fr: Listez les tables que l'utilisateur a ouvertes le plus récemment sur une connexion, de la plus récente à la plus ancienne.
ko: 사용자가 연결에서 가장 최근에 연 테이블을 최신순으로 나열합니다.
tr: Kullanıcının bir bağlantıda en son açtığı tabloları, en yeniden başlayarak listeler.
vi: Liệt kê các bảng mà người dùng mở gần đây nhất trên một kết nối, mới nhất trước.
zh_hans: 列出用户在某个连接上最近打开的表，最新的在前。
zh_hant: 列出使用者在某個連線上最近開啟的資料表，最新的在前。

source: The statement returned no rows to show.
fr: La déclaration n'a retourné aucune ligne à afficher.

source: Leave blank to keep the saved token
fr: Laissez vide pour conserver le jeton sauvegardé.

source: Move Filter Up
fr: Déplacer le filtre vers le haut
ko: 필터를 위로 이동
tr: Filtreyi Yukarı Taşı
vi: Chuyển bộ lọc lên
zh_hans: 上移筛选条件
zh_hant: 將篩選條件上移

source: Duplicate Existing Table
fr: Dupliquer une table existante
ko: 기존 테이블 복제
tr: Mevcut Tabloyu Çoğalt
vi: Nhân bản bảng hiện có
zh_hans: 复制现有表
zh_hant: 複製現有資料表

source: Unsupported database type: %@
fr: Type de base de données non pris en charge : %@
ko: 지원되지 않는 데이터베이스 유형: %@
tr: Desteklenmeyen veritabanı türü: %@
vi: Kiểu cơ sở dữ liệu không hỗ trợ: %@
zh_hans: 不支持的数据库类型：%@
zh_hant: 不支援的資料庫類型：%@

source: CREATE statement, when the engine can produce one
fr: Déclaration CREATE, lorsque le moteur peut en produire un.
ko: 엔진이 생성할 수 있는 경우의 CREATE 명령문
tr: Motor üretebiliyorsa CREATE ifadesi
vi: Câu lệnh CREATE, khi engine tạo được
zh_hans: 引擎能生成时返回的 CREATE 语句
zh_hant: 引擎能產生時回傳的 CREATE 陳述式

source: Auto Increment
fr: Augmentation automatique
ko: 자동 증가
tr: Otomatik Artış
vi: Tự động tăng
zh_hans: 自动递增
zh_hant: 自動遞增

source: Area
fr: Zone
ko: 영역
tr: Alan
vi: Miền
zh_hans: 面积
zh_hant: 面積

source: Search saved query history. Returns matching entries with execution time, row count, and outcome.
fr: Recherche dans l'historique des requêtes enregistrées. Renvoie les entrées correspondantes avec le temps d'exécution, le nombre de lignes et le résultat.
ko: 저장된 쿼리 기록을 검색합니다. 실행 시간, 행 수 및 결과가 포함된 일치 항목을 반환합니다.
tr: Kaydedilmiş sorgu geçmişinde arama yapar. Eşleşen kayıtları yürütme süresi, satır sayısı ve sonuçla birlikte döndürür.
vi: Tìm trong lịch sử truy vấn đã lưu. Trả về các mục khớp kèm thời gian thực thi, số hàng và kết quả.
zh_hans: 搜索已保存的查询历史记录。返回匹配条目及其执行时间、行数和结果。
zh_hant: 搜尋已儲存的查詢歷程記錄。傳回相符的項目，包含執行時間、列數和結果。

source: Serverless SQLite at the edge
fr: SQLite sans serveur à la périphérie.
ko: 엣지의 서버리스 SQLite
tr: Uçta sunucusuz SQLite
vi: SQLite serverless tại biên
zh_hans: 边缘端的无服务器 SQLite
zh_hant: 邊緣端的無伺服器 SQLite

source: Open tabs, ordered by connection then title
fr: Fenêtres de tab ouverte, classées par connexion puis par titre.
ko: 연결순, 그다음 제목순으로 정렬된 열린 탭
tr: Önce bağlantıya sonra başlığa göre sıralanmış açık sekmeler
vi: Các tab đang mở, sắp xếp theo kết nối rồi tới tiêu đề
zh_hans: 已打开的标签页，先按连接再按标题排序
zh_hant: 已開啟的標籤頁，先按連線再按標題排序

source: Turn a question into SQL
fr: Transformer une question en SQL
ko: 질문을 SQL로 바꾸기
tr: Bir soruyu SQL'e dönüştür
vi: Biến một câu hỏi thành SQL
zh_hans: 把问题转成 SQL
zh_hant: 把問題轉成 SQL

source: Activity is retained for 90 days.
fr: L'activité est conservée pendant 90 jours.
ko: 활동은 90일간 보관됩니다.
tr: Etkinlikler 90 gün boyunca saklanır.
vi: Hoạt động được lưu trong 90 ngày.
zh_hans: 活动记录保留 90 天。
zh_hant: 活動記錄保留 90 天。

source: Database default
fr: Par défaut de la base de données

source: Prefix the variant applies
fr: Préfixez la variante s'applique
ko: 변형이 적용하는 접두사
tr: Varyantın uyguladığı ön ek
vi: Tiền tố mà biến thể áp dụng
zh_hans: 该变体应用的前缀
zh_hant: 該變體套用的前綴

source: Something went wrong (error %d). Try again in a moment.
fr: Quelque chose s'est mal passé (erreur %d). Réessayez dans un instant.
ko: 문제가 발생했습니다(오류 %d). 잠시 후 다시 시도하십시오.
tr: Bir hata oluştu (hata %d). Lütfen tekrar deneyin.
vi: Đã xảy ra lỗi (mã %d). Vui lòng thử lại.
zh_hans: 出错了（错误%d），请稍后重试。
zh_hant: 發生錯誤（錯誤 %d）。請稍後再試。

source: Apply Schema Changes
fr: Appliquer les modifications du schéma
ko: 스키마 변경 사항 적용
tr: Şema Değişikliklerini Uygula
vi: Áp dụng thay đổi schema
zh_hans: 应用Schema更改
zh_hant: 套用綱要變更

source: Choose which columns the grid shows
fr: Choisissez les colonnes que la grille affiche
ko: 표에 표시할 열을 선택합니다
tr: Tabloda gösterilecek sütunları seçin
vi: Chọn cột hiển thị trong bảng
zh_hans: 选择表格显示的列
zh_hant: 選擇表格顯示的欄

source: Show line numbers
fr: Afficher les numéros de ligne
ko: 줄 번호 보기
tr: Satır numaralarını göster
vi: Hiện số dòng
zh_hans: 显示行号
zh_hant: 顯示行號

source: Remove Folder
fr: Supprimer le dossier
ko: 폴더 제거
tr: Klasörü Kaldır
vi: Xóa Thư mục
zh_hans: 移除文件夹
zh_hant: 移除資料夾

source: This connection loads SQLite extensions that have not been approved on this Mac.
fr: Cette connexion charge des extensions SQLite qui n'ont pas été approuvées sur ce Mac.

source: Deleted Text
fr: Texte supprimé
ko: 삭제된 텍스트
tr: Silinen Metin
vi: Văn bản đã xoá
zh_hans: 已删除文本
zh_hant: 已刪除文字

source: A command named "/%@" already exists.
fr: Un commande nommé "/%@" existe déjà.
ko: "/%@" 명령이 이미 있습니다.
tr: "/%@" adında bir komut zaten var.
vi: Lệnh có tên "/%@" đã tồn tại.
zh_hans: 名为"/%@"的命令已存在。
zh_hant: 名為「/%@」的指令已存在。

source: Connection Switcher
fr: Commutateur de connexion
ko: 연결 전환기
tr: Bağlantı Değiştirici
vi: Chuyển đổi kết nối
zh_hans: 切换连接
zh_hant: 切換連線

source: Huge
fr: Énorme
ko: 아주 큼
tr: Çok Büyük
vi: Rất lớn
zh_hans: 超大
zh_hant: 超大

source: Nothing is left to copy once the target is taken into account.
fr: Rien ne reste à copier une fois la cible prise en compte.

source: Not connected
fr: Non connecté
ko: 연결되지 않음
vi: Chưa kết nối
zh_hans: 未连接
zh_hant: 未連線

source: This will fetch all remaining rows. Large result sets use significant memory. Continue?
fr: Cela récupérera toutes les lignes restantes. Les ensembles de résultats volumineux consomment une mémoire importante. Continuer ?
ko: 남은 행을 모두 가져옵니다. 결과 집합이 크면 상당한 메모리를 사용합니다. 계속하시겠습니까?
tr: Kalan tüm satırlar getirilecek. Büyük sonuç kümeleri önemli bellek kullanır. Devam edilsin mi?
vi: Thao tác này sẽ tải tất cả dòng còn lại. Tập kết quả lớn sử dụng nhiều bộ nhớ. Tiếp tục?
zh_hans: 此操作将获取所有剩余行。大量结果会占用较多内存。是否继续？
zh_hant: 此操作將擷取所有剩餘的列。大量結果集會佔用大量記憶體。是否繼續？

source: Auto cleanup
fr: Nettoyage automatique
ko: 자동 정리
tr: Otomatik temizleme
vi: Tự động dọn dẹp
zh_hans: 自动清理
zh_hant: 自動清理

source: (Empty)
fr: (Vide)
ko: (비어 있음)
tr: (Boş)
vi: (Trống)
zh_hans: （空）
zh_hant: （空）

source: No values in this row matched the column mapping
fr: Aucun des valeurs de cette ligne n'a correspondu à la mappage de colonne.
ko: 이 행의 어떤 값도 열 매핑과 일치하지 않았습니다
tr: Bu satırdaki hiçbir değer sütun eşlemesiyle eşleşmedi
vi: Không có giá trị nào trong dòng này khớp với ánh xạ cột
zh_hans: 此行中没有值与列映射相匹配
zh_hant: 此列中沒有值與欄位對應相符

source: Jump hosts are connected in order before reaching the SSH server above. Only key and agent auth are supported for jumps.
fr: Les hôtes de saut sont connectés dans l'ordre avant d'atteindre le serveur SSH ci-dessus. Seules l'authentification par clé et agent sont prises en charge pour les sauts.
ko: 점프 호스트에 순서대로 연결한 후 위의 SSH 서버에 연결합니다. 점프 연결에는 키 및 에이전트 인증만 지원됩니다.
tr: Atlama sunucuları yukarıdaki SSH sunucusuna ulaşmadan önce sırayla bağlanır. Atlamalar için yalnızca anahtar ve aracı kimlik doğrulaması desteklenir.
vi: Jump host được kết nối theo thứ tự trước khi đến SSH server phía trên. Chỉ hỗ trợ xác thực bằng khoá và agent cho các jump.
zh_hans: Jump Host 按顺序连接后再连接到上方的 SSH 服务器。跳转仅支持密钥和 Agent 认证。
zh_hant: 跳板主機會依序連線,之後才連到上方的 SSH 伺服器。跳板僅支援金鑰與 Agent 認證。

source: Reconnect failed: %@
fr: Réconnection échouée : %@
ko: 다시 연결하지 못했습니다: %@
tr: Yeniden bağlanma başarısız: %@
vi: Kết nối lại thất bại: %@
zh_hans: 重新连接失败：%@
zh_hant: 重新連線失敗：%@

source: Schema the view lives in
fr: Schéma dans lequel la vue vit
ko: 뷰가 속한 스키마
tr: Görünümün içinde bulunduğu şema
vi: Schema chứa view
zh_hans: 该视图所在的 Schema
zh_hant: 該檢視表所在的綱要

source: The target connection is no longer open.
fr: La connexion cible n'est plus ouverte.
ko: 대상 연결이 더 이상 열려 있지 않습니다.
tr: Hedef bağlantı artık açık değil.
vi: Kết nối đích không còn mở.
zh_hans: 目标连接已不再打开。
zh_hant: 目標連線已不再開啟。

source: Show alternate row backgrounds
fr: Afficher les arrière-plans des lignes alternatives
ko: 행 배경을 번갈아 표시
tr: Satırları dönüşümlü arka planla göster
vi: Hiện nền xen kẽ dòng
zh_hans: 显示交替行背景
zh_hant: 顯示交替列背景

source: Access Key ID
fr: Identifiant de la clé d'accès
ko: 액세스 키 ID

source: Line %1$d: %2$@
fr: Ligne %1$d : %2$@

source: Replaced %1$@ in %2$@.
fr: Remplacé %1$@ dans %2$@.

source: Deactivation Failed
fr: Échec de la désactivation
ko: 비활성화 실패
tr: Devre Dışı Bırakma Başarısız
vi: Hủy kích hoạt thất bại
zh_hans: 停用失败
zh_hant: 停用失敗

source: Use Saved Mapping
fr: Utiliser la cartographie enregistrée

source: Only a SQL dump is read compressed. Expand it first, then import the %@.
fr: Seul un décompte SQL est lu compressé. Développez-le d'abord, puis importez le %@.

source: Include this row
fr: Inclure cette ligne
ko: 이 행 포함
tr: Bu satırı dahil et
vi: Bao gồm dòng này
zh_hans: 包含此行
zh_hant: 納入此列

source: The table %@ was already created with different columns. Choose another name.
fr: La table %@ a déjà été créée avec des colonnes différentes. Choisissez un autre nom.
ko: 테이블 %@은(는) 다른 열 구성으로 이미 생성되어 있습니다. 다른 이름을 선택하십시오.
tr: %@ tablosu farklı sütunlarla zaten oluşturulmuş. Başka bir ad seçin.
vi: Bảng %@ đã được tạo với bộ cột khác. Hãy chọn tên khác.
zh_hans: 表 %@ 已经以不同的列创建过了。请另选一个名称。
zh_hant: 資料表 %@ 已經以不同的欄位建立過了。請另選一個名稱。

source: Used by %lld
fr: Utilisé par %lld

source: Choose AI provider and model
fr: Choisissez le fournisseur et le modèle d'IA
ko: AI 제공업체 및 모델 선택
tr: Yapay zeka sağlayıcısını ve modeli seçin
vi: Chọn nhà cung cấp và mô hình AI
zh_hans: 选择AI提供商和模型
zh_hant: 選擇 AI 供應商與模型

source: Could not build an INSERT for %@
fr: Impossible de construire une INSERT pour %@
ko: %@에 대한 INSERT를 만들 수 없습니다
tr: %@ için bir INSERT oluşturulamadı
vi: Không dựng được câu INSERT cho %@
zh_hans: 无法为 %@ 构建 INSERT 语句
zh_hant: 無法為 %@ 建立 INSERT 陳述式

source: Authentication required
fr: Authentification requise
ko: 인증 필요
tr: Kimlik doğrulama gerekli
vi: Yêu cầu xác thực
zh_hans: 需要认证
zh_hant: 需要身分驗證

source: Drop Sequence
fr: Séquence de chute
ko: 시퀀스 삭제
tr: Diziyi Sil
vi: Xóa Sequence
zh_hans: 删除序列
zh_hant: 刪除序列

source: Convert NULL to EMPTY
fr: Convertir NULL en VIDE
ko: NULL을 EMPTY로 변환
tr: NULL'u BOŞ yap
vi: Chuyển NULL thành RỖNG
zh_hans: 将 NULL 转换为空
zh_hant: 將 NULL 轉換為空

source: Drop trigger “%@”?
fr: Pousse-poussoir "%@" ?
ko: 트리거 “%@”을(를) 삭제하시겠습니까?
tr: “%@” tetikleyicisi silinsin mi?
vi: Xoá trigger “%@”?
zh_hans: 删除触发器“%@”？
zh_hant: 要刪除觸發器「%@」嗎？

source: Hide Query History
fr: Cacher l'historique des requêtes
ko: 쿼리 기록 가리기
tr: Sorgu Geçmişini Gizle
vi: Ẩn lịch sử truy vấn
zh_hans: 隐藏查询历史
zh_hant: 隱藏查詢歷史

source: The tunnel command exited before the port was open.
fr: La commande du tunnel a été terminée avant que le port ne soit ouvert.

source: Status: starting
fr: Statut : en cours de démarrage
ko: 상태: 시작 중
tr: Durum: başlatılıyor
vi: Trạng thái: đang khởi động
zh_hans: 状态：启动中
zh_hant: 狀態：啟動中

source: Query cancelled
fr: La requête annulée
ko: 쿼리가 취소되었습니다
vi: Đã hủy truy vấn
zh_hans: 查询已取消
zh_hant: 查詢已取消

source: Charting the first %1$@ of %2$@ loaded rows
fr: Cartographier le premier %1$@ des lignes %2$@ chargées
ko: 불러온 %2$@행 중 처음 %1$@행을 차트로 표시 중
tr: Yüklenen %2$@ satırın ilk %1$@ tanesi grafiğe alınıyor
vi: Đang vẽ %1$@ trong số %2$@ hàng đã tải đầu tiên
zh_hans: 绘制已加载 %2$@ 行中的前 %1$@ 行
zh_hant: 繪製已載入 %2$@ 列中的前 %1$@ 列

source: Table the triggers belong to, when one was named
fr: Tableau des déclencheurs auxquels ils appartiennent, lorsque l'un d'eux a été nommé.
ko: 테이블을 지정한 경우 트리거가 속한 테이블
tr: Bir tablo belirtildiyse tetikleyicilerin ait olduğu tablo
vi: Bảng mà các trigger thuộc về, khi có chỉ định bảng
zh_hans: 指定了表时，这些触发器所属的表
zh_hant: 指定了資料表時，這些觸發器所屬的資料表

source: Self Cost
fr: Coût personnel

source: Showing %@ rows
fr: Affichage de %@ lignes
ko: %@개 행 표시
tr: %@ satır gösteriliyor
vi: Đang hiển thị %@ hàng
zh_hans: 显示 %@ 行
zh_hant: 顯示 %@ 列

source: Add rows to it
fr: Ajoutez des lignes à cela

source: The action that completed
fr: L'action qui a été terminée
ko: 완료된 작업
tr: Tamamlanan eylem
vi: Hành động đã hoàn tất
zh_hans: 已完成的操作
zh_hant: 已完成的動作

source: New Conversation
fr: Nouvelle conversation
ko: 새 대화
tr: Yeni Konuşma
vi: Hội thoại mới
zh_hans: 新建会话
zh_hant: 新增對話

source: Close parameter panel
fr: Fermer le panneau de paramètres
ko: 매개변수 패널 닫기
tr: Parametre panelini kapat
vi: Đóng bảng tham số
zh_hans: 关闭参数面板
zh_hant: 關閉參數面板

source: Open %@ in New Tab
fr: Ouvrir %@ dans un nouvel onglet
ko: 새 탭에서 %@ 열기
tr: %@ Öğesini Yeni Sekmede Aç
vi: Mở %@ trong tab mới
zh_hans: 在新标签页中打开%@
zh_hant: 在新分頁中開啟 %@

source: Are you sure you want to terminate this session? Any running queries will be aborted.
fr: Êtes-vous sûr de vouloir terminer cette session ? Toutes les requêtes en cours seront annulées.
ko: 이 세션을 종료하시겠습니까? 실행 중인 모든 쿼리가 중단됩니다.
tr: Bu oturumu sonlandırmak istediğinizden emin misiniz? Çalışan sorgular iptal edilecek.
vi: Bạn có chắc muốn kết thúc phiên này? Mọi truy vấn đang chạy sẽ bị huỷ.
zh_hans: 确定要终止此会话吗？正在运行的查询将被中止。
zh_hant: 確定要終止此工作階段嗎？正在執行的查詢將被中止。

source: The connection to the server was closed.
fr: La connexion au serveur a été fermée.

source: Save as Favorite
fr: Enregistrer comme favori
ko: 즐겨찾기로 저장
tr: Favori Olarak Kaydet
vi: Lưu vào yêu thích
zh_hans: 保存为收藏
zh_hant: 儲存為我的最愛

source: Search shortcuts…
fr: Accès rapides de recherche...
ko: 단축키 검색…
tr: Kısayollarda ara…
vi: Tìm phím tắt…
zh_hans: 搜索快捷键…
zh_hant: 搜尋快速鍵…

source: Passphrases do not match
fr: Les mots de passe ne correspondent pas
ko: 암호 구문이 일치하지 않음
tr: Parolalar eşleşmiyor
vi: Cụm mật khẩu không khớp
zh_hans: 密码短语不匹配
zh_hant: 通關密語不相符

source: Review the current query against its tables
fr: Examinez la requête actuelle par rapport à ses tables.

# Changing %@ from %@ to %@ can truncate existing values.
source: Changing %1$@ from %2$@ to %3$@ can truncate existing values.
fr: La modification de %1$@ de %2$@ à %3$@ peut truncater les valeurs existantes.
ko: %@을(를) %@에서 %@(으)로 변경하면 기존 값이 잘릴 수 있습니다.
tr: %1$@ sütununu %2$@ türünden %3$@ türüne değiştirmek mevcut değerleri kısaltabilir.
vi: Đổi %1$@ từ %2$@ sang %3$@ có thể cắt ngắn các giá trị hiện có.
zh_hans: 将 %1$@ 从 %2$@ 改为 %3$@ 可能会截断现有值。
zh_hant: 將 %1$@ 從 %2$@ 改為 %3$@ 可能會截斷現有值。

source: The driver cannot write %lld edited rows.
fr: Le pilote ne peut pas écrire %lld lignes modifiées.

source: Table the statistics describe
fr: Tableau des statistiques décrites
ko: 통계가 설명하는 테이블
tr: İstatistiklerin açıkladığı tablo
vi: Bảng mà các số liệu thống kê mô tả
zh_hans: 这些统计信息所描述的表
zh_hant: 這些統計資訊所描述的資料表

source: Period
fr: Période
ko: 기간
vi: Chu kỳ
zh_hans: 周期
zh_hant: 週期

source: CA certificate is required for verification modes
fr: Le certificat CA est requis pour les modes de vérification.
ko: 검증 모드에는 CA 인증서가 필요합니다
tr: Doğrulama modları için CA sertifikası gerekli
vi: Cần chứng chỉ CA cho các chế độ xác minh
zh_hans: 验证模式需要CA证书
zh_hant: 驗證模式需要 CA 憑證

source: Export Data (⌘⇧E)
fr: Exportation de données (⌘⇧E)
ko: 데이터 내보내기(⌘⇧E)
tr: Veriyi Dışa Aktar (⌘⇧E)
vi: Xuất dữ liệu (⌘⇧E)
zh_hans: 导出数据 (⌘⇧E)
zh_hant: 匯出資料 (⌘⇧E)

source: Import completed with errors
fr: Importation terminée avec des erreurs
ko: 오류가 발생했지만 가져오기 완료
tr: İçe aktarma hatalarla tamamlandı
vi: Nhập xong nhưng có lỗi
zh_hans: 导入完成，但有错误
zh_hant: 匯入完成，但有錯誤

source: The source driver cannot stream rows for a comparison.
fr: Le pilote de source ne peut pas diffuser des lignes pour une comparaison.
ko: 원본 드라이버는 비교를 위해 행을 스트리밍할 수 없습니다.
tr: Kaynak sürücü karşılaştırma için satır akıtamıyor.
vi: Driver nguồn không thể đọc dòng theo luồng để so sánh.
zh_hans: 来源驱动无法为比较流式读取行。
zh_hant: 來源驅動程式無法為比較串流讀取列。

source: Whether the column accepts NULL
fr: Que la colonne accepte NULL ou non
ko: 열이 NULL을 허용하는지 여부
tr: Sütunun NULL kabul edip etmediği
vi: Cột có chấp nhận NULL hay không
zh_hans: 该列是否接受 NULL
zh_hant: 該欄位是否接受 NULL

source: greater than
fr: Plus grand que
ko: 보다 큼
tr: büyüktür
vi: lớn hơn
zh_hans: 大于
zh_hant: 大於

source: Merging Columns…
fr: Fusion des colonnes...

source: MySQL and MariaDB. Drops the table's next key value. The column keeps its AUTO_INCREMENT attribute, and restoring rows sets the counter from the data.
fr: MySQL et MariaDB. Supprime la prochaine valeur clé de la table. La colonne conserve son attribut AUTO_INCREMENT, et la restauration des lignes définit le compteur à partir des données.
ko: MySQL 및 MariaDB. 테이블의 다음 키 값을 제외합니다. 열은 AUTO_INCREMENT 속성을 유지하며, 행을 복원하면 데이터를 기준으로 카운터가 설정됩니다.
tr: MySQL ve MariaDB. Tablonun bir sonraki anahtar değerini çıkarır. Sütun AUTO_INCREMENT özelliğini korur ve satırlar geri yüklendiğinde sayaç verilerden belirlenir.
vi: MySQL và MariaDB. Bỏ giá trị khóa kế tiếp của bảng. Cột vẫn giữ thuộc tính AUTO_INCREMENT, và khi khôi phục các hàng, bộ đếm được đặt theo dữ liệu.
zh_hans: MySQL 和 MariaDB。移除表的下一个键值。列仍保留 AUTO_INCREMENT 属性，恢复数据行时会根据数据设置计数器。
zh_hant: MySQL 和 MariaDB。移除資料表的下一個鍵值。欄位仍保留 AUTO_INCREMENT 屬性，還原資料列時會依資料設定計數器。

source: Not Compared Yet
fr: Pas encore comparé
ko: 아직 비교하지 않음
tr: Henüz Karşılaştırılmadı
vi: Chưa so sánh
zh_hans: 尚未比较
zh_hant: 尚未比較

source: Returns %@
fr: Retours %@
ko: %@ 반환
tr: %@ döndürür
vi: Trả về %@
zh_hans: 返回 %@
zh_hant: 回傳 %@

source: 100 rows
fr: 100 rangées
ko: 100개 행
tr: 100 satır
vi: 100 dòng
zh_hans: 100 行
zh_hant: 100 列

source: Target
fr: Cible
ko: 대상
tr: Hedef
vi: Đích
zh_hans: 目标
zh_hant: 目標

source: %1$@ must be between %2$lld and %3$lld.
fr: %1$@ doit être entre %2$lld et %3$lld.

source: Apply to %@
fr: Postuler à %@
ko: %@에 적용
tr: %@ üzerine uygula
vi: Áp dụng vào %@
zh_hans: 应用到 %@
zh_hant: 套用到 %@

source: Delete Group…
fr: Supprimer le groupe...

# Explanation of %@ on %@
source: Explanation of %1$@ on %2$@
fr: Explication de %1$@ sur %2$@
ko: %2$@의 %1$@에 대한 설명
tr: %2$@ üzerindeki %1$@ açıklaması
vi: Giải thích về %1$@ trên %2$@
zh_hans: 对 %2$@ 上 %1$@ 的讲解
zh_hant: 對 %2$@ 上 %1$@ 的講解

source: Create New Group
fr: Créer un nouveau groupe
ko: 새 그룹 생성
tr: Yeni Grup Oluştur
vi: Tạo nhóm mới
zh_hans: 创建新分组
zh_hant: 建立新群組

source: ampersand
fr: esperluette
ko: 앰퍼샌드
tr: ve işareti
vi: dấu và
zh_hans: 和号
zh_hant: 和號

source: %@ cannot compare two of its own databases at once, because it reads both through one connection. Use a second connection for the target.
fr: %@ ne peut pas comparer deux de ses propres bases de données à la fois, car il les lit toutes les deux via une seule connexion. Utilisez une deuxième connexion pour la cible.
ko: %@은(는) 하나의 연결로 양쪽을 읽기 때문에 자체 데이터베이스 두 개를 동시에 비교할 수 없습니다. 대상에는 다른 연결을 사용하십시오.
tr: %@ kendi iki veritabanını aynı anda karşılaştıramaz, çünkü ikisini de tek bağlantı üzerinden okur. Hedef için ikinci bir bağlantı kullanın.
vi: %@ không thể so sánh hai cơ sở dữ liệu của chính nó cùng lúc, vì nó đọc cả hai qua một kết nối. Hãy dùng kết nối thứ hai cho đích.
zh_hans: %@ 无法同时比较自身的两个数据库，因为它通过一个连接读取两者。请为目标使用第二个连接。
zh_hant: %@ 無法同時比較自身的兩個資料庫，因為它透過一個連線讀取兩者。請為目標使用第二個連線。

source: Service token ID and secret are required
fr: L'identifiant du jeton de service et le secret sont requis.
ko: 서비스 토큰 ID와 시크릿이 필요합니다
tr: Hizmet jetonu kimliği ve gizli anahtarı gereklidir
vi: Cần ID và secret của service token
zh_hans: 需要服务令牌 ID 和密钥
zh_hant: 需要服務權杖 ID 和金鑰

source: That filter operator is not supported.
fr: Cet opérateur de filtre n'est pas pris en charge.
ko: 해당 필터 연산자는 지원되지 않습니다.
tr: Bu filtre operatörü desteklenmiyor.
vi: Toán tử lọc đó không được hỗ trợ.
zh_hans: 不支持该筛选运算符。
zh_hant: 不支援該篩選運算子。

source: Unsupported schema operation: %@
fr: Opération de schéma non prise en charge : %@
ko: 지원되지 않는 스키마 작업: %@
tr: Desteklenmeyen şema işlemi: %@
vi: Thao tác schema không được hỗ trợ: %@
zh_hans: 不支持的 Schema 操作：%@
zh_hant: 不支援的綱要操作：%@

source: Connection
fr: Connexion
ko: 연결
tr: Bağlantı
vi: Kết nối
zh_hans: 连接
zh_hant: 連線

source: The query is empty.
fr: La requête est vide.
ko: 쿼리가 비어 있습니다.
tr: Sorgu boş.
vi: Truy vấn rỗng.
zh_hans: 查询为空。
zh_hant: 查詢為空。

source: Export query results to %@
fr: Exporter les résultats de la requête vers %@
ko: 쿼리 결과를 %@(으)로 내보내기
tr: Sorgu sonuçlarını %@ olarak dışa aktar
vi: Xuất kết quả truy vấn sang %@
zh_hans: 将查询结果导出为 %@
zh_hant: 將查詢結果匯出為 %@

source: The file has uncommitted changes. Restoring this version replaces them, and you can't undo this action.
fr: Le fichier a des modifications non engagées. La restauration de cette version les remplace, et vous ne pouvez pas annuler cette action.

source: This server has no credential. Add its token in Settings > Integrations.
fr: Ce serveur n'a pas de crédentials. Ajoutez son jeton dans Paramètres > Intégrations.

source: No Favorites in This %@
fr: Aucun favori dans ce %@
